export type lifeModelProps = {
  title: string;
  desc: string;
  date: string;
};

export const lifeModel: lifeModelProps[] = [
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "현직 PT 강사가 말하는, 운동으로 우울증 극복하는 법",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "현직 PT 강사가 말하는, 운동으로 우울증 극복하는 법",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "현직 PT 강사가 말하는, 운동으로 우울증 극복하는 법",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "현직 PT 강사가 말하는, 운동으로 우울증 극복하는 법",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "우울증엔 이것이 정답! 하루에 10분만 투자해보세요.",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
  {
    title: "현직 PT 강사가 말하는, 운동으로 우울증 극복하는 법",
    desc: "우리 커다란 가슴에 약동하다. 무엇이 방지하는 살 길지 대고, 피어나기 청춘이 사막이다.",
    date: "3일 전",
  },
];
